# ~/.config/Brewfile
# Managed by Homebrew Bundle — install with: brew bundle --file=~/.config/Brewfile
# Tiered: core packages are required by configs in this repo; optional are commented out.

# ── Core: Shell ──────────────────────────────────────────
brew "bash"
brew "bash-completion@2"

# ── Core: Prompt ─────────────────────────────────────────
brew "liquidprompt"

# ── Core: Git ────────────────────────────────────────────
brew "git"
brew "gh"

# ── Core: Linting & formatting (required by git hooks) ──
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "yamllint"
brew "tidy-html5"
brew "markdownlint-cli"

# ── Core: Tools referenced by configs ────────────────────
brew "bat"
brew "coreutils"            # provides GNU timeout, gdate, etc.
brew "vim"
brew "pipx"
brew "ripgrep"

# ── Core: Notifications (used by functions.sh _notif) ────
brew "terminal-notifier"

# ── Optional: uncomment packages you want ────────────────
# brew "mas"                # Mac App Store CLI (used by `updates` function)
# brew "yt-dlp"             # Video downloader
# brew "s-search"           # Web search from terminal
# brew "tmux"               # Terminal multiplexer
# brew "tree"               # Directory tree display
# brew "watch"              # Repeat commands
# brew "jq"                 # JSON processor
# brew "pdfgrep"            # PDF search
# brew "nmap"               # Network scanner
# brew "rsync"              # Better rsync than macOS default
